wsdls/live/tracking.xml

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="Service_1_0" targetNamespace="http://ws.aramex.net/ShippingAPI/v1/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="http://ws.aramex.net/ShippingAPI/v1/" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"><wsp:Policy wsu:Id="BasicHttpBinding_Service_1_01_policy"><wsp:ExactlyOne><wsp:All><sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy"><wsp:Policy><sp:TransportToken><wsp:Policy><sp:HttpsToken RequireClientCertificate="false"/></wsp:Policy></sp:TransportToken><sp:AlgorithmSuite><wsp:Policy><sp:Basic256/></wsp:Policy></sp:AlgorithmSuite><sp:Layout><wsp:Policy><sp:Strict/></wsp:Policy></sp:Layout></wsp:Policy></sp:TransportBinding></wsp:All></wsp:ExactlyOne></wsp:Policy><wsdl:types><xs:schema elementFormDefault="qualified" targetNamespace="http://ws.aramex.net/ShippingAPI/v1/" xmlns:xs="http://www.w3.org/2001/XMLSchema"><xs:import namespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/><xs:element name="ShipmentTrackingRequest"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="ClientInfo" nillable="true" type="tns:ClientInfo"/><xs:element minOccurs="0" name="Transaction" nillable="true" type="tns:Transaction"/><xs:element minOccurs="0" name="Shipments" nillable="true" type="q1:ArrayOfstring" xmlns:q1="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/><xs:element minOccurs="0" name="GetLastTrackingUpdateOnly" type="xs:boolean"/></xs:sequence></xs:complexType></xs:element><xs:complexType name="ClientInfo"><xs:sequence><xs:element name="UserName" nillable="true" type="xs:string"/><xs:element name="Password" nillable="true" type="xs:string"/><xs:element name="Version" nillable="true" type="xs:string"/><xs:element name="AccountNumber" nillable="true" type="xs:string"/><xs:element name="AccountPin" nillable="true" type="xs:string"/><xs:element name="AccountEntity" nillable="true" type="xs:string"/><xs:element name="AccountCountryCode" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Source" type="xs:int"/><xs:element minOccurs="0" name="PreferredLanguageCode" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="ClientInfo" nillable="true" type="tns:ClientInfo"/><xs:complexType name="Transaction"><xs:sequence><xs:element name="Reference1" nillable="true" type="xs:string"/><xs:element name="Reference2" nillable="true" type="xs:string"/><xs:element name="Reference3" nillable="true" type="xs:string"/><xs:element name="Reference4" nillable="true" type="xs:string"/><xs:element name="Reference5" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="Transaction" nillable="true" type="tns:Transaction"/><xs:element name="ShipmentTrackingResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="Transaction" nillable="true" type="tns:Transaction"/><xs:element minOccurs="0" name="Notifications" nillable="true" type="tns:ArrayOfNotification"/><xs:element minOccurs="0" name="HasErrors" type="xs:boolean"/><xs:element minOccurs="0" name="TrackingResults" nillable="true" type="q2:ArrayOfKeyValueOfstringArrayOfTrackingResultmFAkxlpY" xmlns:q2="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/><xs:element minOccurs="0" name="NonExistingWaybills" nillable="true" type="q3:ArrayOfstring" xmlns:q3="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/></xs:sequence></xs:complexType></xs:element><xs:complexType name="ArrayOfNotification"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="Notification" nillable="true" type="tns:Notification"/></xs:sequence></xs:complexType><xs:element name="ArrayOfNotification" nillable="true" type="tns:ArrayOfNotification"/><xs:complexType name="Notification"><xs:sequence><xs:element name="Code" nillable="true" type="xs:string"/><xs:element name="Message" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="Notification" nillable="true" type="tns:Notification"/><xs:complexType name="ArrayOfTrackingResult"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="TrackingResult" nillable="true" type="tns:TrackingResult"/></xs:sequence></xs:complexType><xs:element name="ArrayOfTrackingResult" nillable="true" type="tns:ArrayOfTrackingResult"/><xs:complexType name="TrackingResult"><xs:sequence><xs:element name="WaybillNumber" nillable="true" type="xs:string"/><xs:element name="UpdateCode" nillable="true" type="xs:string"/><xs:element name="UpdateDescription" nillable="true" type="xs:string"/><xs:element name="UpdateDateTime" type="xs:dateTime"/><xs:element name="UpdateLocation" nillable="true" type="xs:string"/><xs:element name="Comments" nillable="true" type="xs:string"/><xs:element name="ProblemCode" nillable="true" type="xs:string"/><xs:element name="GrossWeight" nillable="true" type="xs:string"/><xs:element name="ChargeableWeight" nillable="true" type="xs:string"/><xs:element name="WeightUnit" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="TrackingResult" nillable="true" type="tns:TrackingResult"/><xs:element name="PickupTrackingRequest"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="ClientInfo" nillable="true" type="tns:ClientInfo"/><xs:element minOccurs="0" name="Transaction" nillable="true" type="tns:Transaction"/><xs:element minOccurs="0" name="Reference" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="PickupTrackingResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="Transaction" nillable="true" type="tns:Transaction"/><xs:element minOccurs="0" name="Notifications" nillable="true" type="tns:ArrayOfNotification"/><xs:element minOccurs="0" name="HasErrors" type="xs:boolean"/><xs:element minOccurs="0" name="Entity" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Reference" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="CollectionDate" nillable="true" type="xs:dateTime"/><xs:element minOccurs="0" name="PickupDate" nillable="true" type="xs:dateTime"/><xs:element minOccurs="0" name="LastStatus" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="LastStatusDescription" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="CollectedWaybills" nillable="true" type="q4:ArrayOfstring" xmlns:q4="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/></xs:sequence></xs:complexType></xs:element></xs:schema><xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/"><xs:element name="anyType" nillable="true" type="xs:anyType"/><xs:element name="anyURI" nillable="true" type="xs:anyURI"/><xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/><xs:element name="boolean" nillable="true" type="xs:boolean"/><xs:element name="byte" nillable="true" type="xs:byte"/><xs:element name="dateTime" nillable="true" type="xs:dateTime"/><xs:element name="decimal" nillable="true" type="xs:decimal"/><xs:element name="double" nillable="true" type="xs:double"/><xs:element name="float" nillable="true" type="xs:float"/><xs:element name="int" nillable="true" type="xs:int"/><xs:element name="long" nillable="true" type="xs:long"/><xs:element name="QName" nillable="true" type="xs:QName"/><xs:element name="short" nillable="true" type="xs:short"/><xs:element name="string" nillable="true" type="xs:string"/><xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/><xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/><xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/><xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/><xs:element name="char" nillable="true" type="tns:char"/><xs:simpleType name="char"><xs:restriction base="xs:int"/></xs:simpleType><xs:element name="duration" nillable="true" type="tns:duration"/><xs:simpleType name="duration"><xs:restriction base="xs:duration"><xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/><xs:minInclusive value="-P10675199DT2H48M5.4775808S"/><xs:maxInclusive value="P10675199DT2H48M5.4775807S"/></xs:restriction></xs:simpleType><xs:element name="guid" nillable="true" type="tns:guid"/><xs:simpleType name="guid"><xs:restriction base="xs:string"><xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/></xs:restriction></xs:simpleType><xs:attribute name="FactoryType" type="xs:QName"/><xs:attribute name="Id" type="xs:ID"/><xs:attribute name="Ref" type="xs:IDREF"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/Arrays"><xs:import namespace="http://ws.aramex.net/ShippingAPI/v1/"/><xs:complexType name="ArrayOfstring"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="string" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="ArrayOfstring" nillable="true" type="tns:ArrayOfstring"/><xs:complexType name="ArrayOfKeyValueOfstringArrayOfTrackingResultmFAkxlpY"><xs:annotation><xs:appinfo><IsDictionary xmlns="http://schemas.microsoft.com/2003/10/Serialization/">true</IsDictionary></xs:appinfo></xs:annotation><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="KeyValueOfstringArrayOfTrackingResultmFAkxlpY"><xs:complexType><xs:sequence><xs:element name="Key" nillable="true" type="xs:string"/><xs:element name="Value" nillable="true" type="q1:ArrayOfTrackingResult" xmlns:q1="http://ws.aramex.net/ShippingAPI/v1/"/></xs:sequence></xs:complexType></xs:element></xs:sequence></xs:complexType><xs:element name="ArrayOfKeyValueOfstringArrayOfTrackingResultmFAkxlpY" nillable="true" type="tns:ArrayOfKeyValueOfstringArrayOfTrackingResultmFAkxlpY"/></xs:schema></wsdl:types><wsdl:message name="ShipmentTrackingRequest"><wsdl:part name="parameters" element="tns:ShipmentTrackingRequest"/></wsdl:message><wsdl:message name="ShipmentTrackingResponse"><wsdl:part name="parameters" element="tns:ShipmentTrackingResponse"/></wsdl:message><wsdl:message name="PickupTrackingRequest"><wsdl:part name="parameters" element="tns:PickupTrackingRequest"/></wsdl:message><wsdl:message name="PickupTrackingResponse"><wsdl:part name="parameters" element="tns:PickupTrackingResponse"/></wsdl:message><wsdl:portType name="Service_1_0"><wsdl:operation name="TrackShipments"><wsdl:input wsaw:Action="http://ws.aramex.net/ShippingAPI/v1/Service_1_0/TrackShipments" name="ShipmentTrackingRequest" message="tns:ShipmentTrackingRequest"/><wsdl:output wsaw:Action="http://ws.aramex.net/ShippingAPI/v1/Service_1_0/TrackShipmentsResponse" name="ShipmentTrackingResponse" message="tns:ShipmentTrackingResponse"/></wsdl:operation><wsdl:operation name="TrackPickup"><wsdl:input wsaw:Action="http://ws.aramex.net/ShippingAPI/v1/Service_1_0/TrackPickup" name="PickupTrackingRequest" message="tns:PickupTrackingRequest"/><wsdl:output wsaw:Action="http://ws.aramex.net/ShippingAPI/v1/Service_1_0/TrackPickupResponse" name="PickupTrackingResponse" message="tns:PickupTrackingResponse"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_Service_1_0" type="tns:Service_1_0"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="TrackShipments"><soap:operation soapAction="http://ws.aramex.net/ShippingAPI/v1/Service_1_0/TrackShipments" style="document"/><wsdl:input name="ShipmentTrackingRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="ShipmentTrackingResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="TrackPickup"><soap:operation soapAction="http://ws.aramex.net/ShippingAPI/v1/Service_1_0/TrackPickup" style="document"/><wsdl:input name="PickupTrackingRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="PickupTrackingResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:binding name="BasicHttpBinding_Service_1_01" type="tns:Service_1_0"><wsp:PolicyReference URI="#BasicHttpBinding_Service_1_01_policy"/><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="TrackShipments"><soap:operation soapAction="http://ws.aramex.net/ShippingAPI/v1/Service_1_0/TrackShipments" style="document"/><wsdl:input name="ShipmentTrackingRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="ShipmentTrackingResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="TrackPickup"><soap:operation soapAction="http://ws.aramex.net/ShippingAPI/v1/Service_1_0/TrackPickup" style="document"/><wsdl:input name="PickupTrackingRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="PickupTrackingResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="Service_1_0"><wsdl:port name="BasicHttpBinding_Service_1_0" binding="tns:BasicHttpBinding_Service_1_0"><soap:address location="http://ws.aramex.net/ShippingAPI.V2/Tracking/Service_1_0.svc"/></wsdl:port><wsdl:port name="BasicHttpBinding_Service_1_01" binding="tns:BasicHttpBinding_Service_1_01"><soap:address location="https://ws.aramex.net/ShippingAPI.V2/Tracking/Service_1_0.svc"/></wsdl:port></wsdl:service></wsdl:definitions>